import java.util.ArrayList;

public class setUp {
    void database(Shop shop) {
        Group one = new Group("Ручки для армреслінгу", "опис групи");
        one.addProduct(new Product("Ексцентрична ручка", "опис", "IFactory", 10, 700));
        one.addProduct(new Product("Ручка на лямках", "опис", "IFactory", 10, 600));
        one.addProduct(new Product("Конусна ручка", "опис", "IFactory", 10, 700));
        one.addProduct(new Product("Ручка на підшипниках", "опис", "IFactory", 10, 650));

        Group two = new Group("Фітнес гумки", "опис групи");
        two.addProduct(new Product("Набір гумок 20-70 кг", "Фітнес гумка - це сучасний,\n" +
                "зручний та ефективний спортивний снаряд, який можна використовувати для занять\n" +
                "фітнесом, йогою, пілатесом та кросфітом. Також фітнес гумки називають фітнес стрічками,\n" +
                "гумками для фітнесу, спортивними гумками, стрічками-амортизаторами,\n" +
                "гумовими еспандерами. Використовувати їх можна\n" +
                "для окремих тренувальних програм виключно з гумками, або як обтяження для\n" +
                "підвищення ефективності при виконанні базових вправ з гантелями або штангою.", "SuperRezyna", 15, 1400));
        two.addProduct(new Product("Фітнес-гумка 20 кг", "Фітнес гумка - це сучасний,\n" +
                "зручний та ефективний спортивний снаряд, який можна використовувати для занять\n" +
                "фітнесом, йогою, пілатесом та кросфітом. Також фітнес гумки називають фітнес стрічками,\n" +
                "гумками для фітнесу, спортивними гумками, стрічками-амортизаторами,\n" +
                "гумовими еспандерами. Використовувати їх можна\n" +
                "для окремих тренувальних програм виключно з гумками, або як обтяження для\n" +
                "підвищення ефективності при виконанні базових вправ з гантелями або штангою.", "SuperGymka", 20, 300));
        two.addProduct(new Product("Фітнес-гумка 30 кг", "Фітнес гумка - це сучасний,\n" +
                "зручний та ефективний спортивний снаряд, який можна використовувати для занять\n" +
                "фітнесом, йогою, пілатесом та кросфітом. Також фітнес гумки називають фітнес стрічками,\n" +
                "гумками для фітнесу, спортивними гумками, стрічками-амортизаторами,\n" +
                "гумовими еспандерами. Використовувати їх можна\n" +
                "для окремих тренувальних програм виключно з гумками, або як обтяження для\n" +
                "підвищення ефективності при виконанні базових вправ з гантелями або штангою.", "SuperGymka", 17, 300));
        two.addProduct(new Product("Фітнес-гумка 40 кг", "Фітнес гумка - це сучасний,\n" +
                "зручний та ефективний спортивний снаряд, який можна використовувати для занять\n" +
                "фітнесом, йогою, пілатесом та кросфітом. Також фітнес гумки називають фітнес стрічками,\n" +
                "гумками для фітнесу, спортивними гумками, стрічками-амортизаторами,\n" +
                "гумовими еспандерами. Використовувати їх можна\n" +
                "для окремих тренувальних програм виключно з гумками, або як обтяження для\n" +
                "підвищення ефективності при виконанні базових вправ з гантелями або штангою.", "SuperGymka", 16, 300));
        two.addProduct(new Product("Фітнес-гумка 50 кг", "Фітнес гумка - це сучасний,\n" +
                "зручний та ефективний спортивний снаряд, який можна використовувати для занять\n" +
                "фітнесом, йогою, пілатесом та кросфітом. Також фітнес гумки називають фітнес стрічками,\n" +
                "гумками для фітнесу, спортивними гумками, стрічками-амортизаторами,\n" +
                "гумовими еспандерами. Використовувати їх можна\n" +
                "для окремих тренувальних програм виключно з гумками, або як обтяження для\n" +
                "підвищення ефективності при виконанні базових вправ з гантелями або штангою.", "SuperGymka", 20, 300));
        two.addProduct(new Product("Фітнес-гумка 60 кг", "Фітнес гумка - це сучасний,\n" +
                "зручний та ефективний спортивний снаряд, який можна використовувати для занять\n" +
                "фітнесом, йогою, пілатесом та кросфітом. Також фітнес гумки називають фітнес стрічками,\n" +
                "гумками для фітнесу, спортивними гумками, стрічками-амортизаторами,\n" +
                "гумовими еспандерами. Використовувати їх можна\n" +
                "для окремих тренувальних програм виключно з гумками, або як обтяження для\n" +
                "підвищення ефективності при виконанні базових вправ з гантелями або штангою.", "SuperRezyna", 23, 300));
        two.addProduct(new Product("Фітнес-гумка 70 кг", "Фітнес гумка - це сучасний,\n" +
                "зручний та ефективний спортивний снаряд, який можна використовувати для занять\n" +
                "фітнесом, йогою, пілатесом та кросфітом. Також фітнес гумки називають фітнес стрічками,\n" +
                "гумками для фітнесу, спортивними гумками, стрічками-амортизаторами,\n" +
                "гумовими еспандерами. Використовувати їх можна\n" +
                "для окремих тренувальних програм виключно з гумками, або як обтяження для\n" +
                "підвищення ефективності при виконанні базових вправ з гантелями або штангою.", "SuperGymka", 25, 300));

        Group three = new Group("Лавки для жиму лежачи", "опис групи");
        three.addProduct(new Product("Лавка для жиму нерегульованна", "неопис", "IFactory", 5, 2000));
        three.addProduct(new Product("Лавка для жиму регульованна, ", "неопис2", "IFactory", 2, 3500));


        Group four = new Group("Гантелі", "опис групи");
        four.addProduct(new Product("Гантелі розбірні 28 кг", "неопис", "GymIron", 50, 2000));
        four.addProduct(new Product("Гантелі нерозбірні 28 кг", "неопис2", "GymIron", 50, 2500));

        Group five = new Group("Грифи", "опис групи");
        five.addProduct(new Product("Гриф олімійський", "неопис", "невиробник", 10, 7000));
        five.addProduct(new Product("Гриф V-форма", "неопис2", "невиробник2", 24, 800));
        shop.addGroup(one);
        shop.addGroup(two);
        shop.addGroup(three);
        shop.addGroup(four);
        shop.addGroup(five);

    }
}
